{
          "millwood" : {
            "id": 1,
            "title": "Millwood",
            "desc": "When my church approach me i was super excited to do this project.  Not only did I get to do what I love but I felt I got to help my community as well.  We migrated the site from a old 5 year old drupal site.  The site is features a fully customized theme along with a facebook and constant contact integration. The website is now fully maintain by the staff at Millwood Christian Church",
            "type": "url",
						"thumb": "https://digitalkdogg.github.io/src/includes/img/millwood.png",
            "thumbname" : "millwood",
						"platform": "PHP / Wordpres",
						"skills": "PHP, Wordpres, jQuery, git, UX Design, CMS",
            "href": "https://millwoodchurchnwa.com"
          },
          "checkbook" : {
            "id": 2,
            "title": "Checkbook",
            "desc": "Checkbook was a personal project that I did a couple of years ago that I still use today.  I needed an application that would allow me to keep track of my bills and help me balance my budget.  I didn\"t lke anything out there so I wrote my own.  The app is made in php 7 with codeigniter and runs off my own MySQL server",
            "type": "url",
						"platform": "PHP - Codeigniter",
						"thumb": "https://digitalkdogg.github.io/src/includes/img/checkbook_scaled.png",
            "thumbname" : "checkbook",
						"skills": "PHP, MySQL, Bootstrap 3, Responsive Design, Restfull API Design ",
            "href" : "#"
        },
          "olympic" : {
            "id": 3,
            "title": "Olympic Inspection",
            "desc": "Olympic Inspection is a site that I develop for a customer to help start up thier small business doing home inspections. It is really interesting to work with a company from the ground up and really see how the website really does help and grow their business.  The site is build with wordpress and features a custom theme along with a contact / db form.",
            "type": "url",
						"thumb": "https://digitalkdogg.github.io/src/includes/img/olympic_inspection.png",
            "thumbname" : "olympic",
						"platform": "PHP - Wordpress",
						"skills": "PHP, MySQL, jQuery",
            "href" : "https://olympicinspection.com"
        },
          "checkboxme" : {
            "id": 4,
            "title": "Checkbox.me",
            "desc": "This was my first attempted at making a jQuery plugin.  I need this because I was working on a project that required me to make a little bit more fancy of a checkbox.  I did some digging around and came up wiht this way to render a checkbox using a div and an web font.  I decided to turn this into a plugin in case anyone wanted to use it.",
            "type": "url",
						"thumb": "https://digitalkdogg.github.io/src/includes/img/checkboxme.png",
            "thumbname" : "checkboxme",
						"platform": "jQuery",
						"skills": "jQuery, Plugin Design, javascript",
            "href": "https://digitalkdogg.github.io/checkbox.github.io"
          },
          "millwoodadmin" : {
            "id": 5,
            "title": "Millwood Admin",
            "desc": "To help support the Millwood church website, we need an applicaiton to take care of some administrative tasks.  For example, the product owner will create a constant contact newsletter and than use this admin site to import into the news section of the website.  We did it this way instead of doing a straight api feed because we wanted the ability to pick and choose which news letters show up on the website.",
						"type": "url",
						"thumb": "https://digitalkdogg.github.io/src/includes/img/millwood_admin.png",
            "thumbname" : "millwoodadmin",
						"platform": "PHP 7",
						"skills": "PHP, javascript, Restful API, data integration",
						"href": "#"
          },
          "plexmanager" : {
            "id": 6,
            "title": "Plex Manager",
            "desc": "I have over 200 movies stored on my plex server.  I made this application to help me categorize and optimize my plex library.  The plex application doesn\"t have this functionality.  Built with Laravel 5 and leverages the plex api service." ,
            "type": "url",
            "thumb": "https://digitalkdogg.github.io/src/includes/img/plex_admin.png",
            "thumbname" : "plexmanager",
            "platform": "PHP - Laravel",
            "skills": "PHP, javascript, Restful API",
            "href": "#"
          },
          "resume" : {
            "id": 7,
            "title": "Resume Builder",
            "desc": "Another personal project that I did in my spare time.  I wanted something to help me keep track of new opportunities that I am interested and I have applied for.  The application is build in code ignitor and uses the mPDF class to dymanically generate PDF\"s",
            "type": "url",
            "thumb": "https://digitalkdogg.github.io/src/includes/img/resume_admin.png",
            "thumbname": "resumeadmin",
            "platform": "PHP - Codeigniter",
            "skills": "PHP, MySQL, jQuery, boostrap",
            "href" : ".#"
        } }